---
kind: property
id: P:Autodesk.Revit.DB.Face.EdgeLoops
source: html/2ccb511d-b5df-8d17-bd9e-3c9aff8cf234.htm
---
# Autodesk.Revit.DB.Face.EdgeLoops Property

A collection of edge loops. Each edge loop represents one of the closed boundaries of the face.

## Syntax (C#)
```csharp
public EdgeArrayArray EdgeLoops { get; }
```